/*
 * Encoding tables.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * You can redistribute this program and/or modify it under the terms of
 * the GNU General Public License as published by the Free Software Foundation;
 * either version 2 of the License, or (at your discretion) any later version.
 * See the accompanying file "COPYING" for more details.
 */
#include "defs.h"

/*
 * GOST-10859 encoding.
 * Documentation: http://en.wikipedia.org/wiki/GOST_10859
 */
uchar koi8_to_gost[] = {
/*  !"#$%&' */	0017,   0133,   0134,   0034,   0127,   0126,   0121,   0033,
/* ()*+,-./ */	0022,   0023,   0031,   0012,   0015,   0013,   0016,   0014,
/* 01234567 */	0000,   0001,   0002,   0003,   0004,   0005,   0006,   0007,
/* 89:;<=>? */	0010,   0011,   0037,   0026,   0035,   0025,   0036,   0136,
/* @ABCDEFG */	0021,   0040,   0042,   0061,   0077,   0045,   0100,   0101,
/* HIJKLMNO */	0055,   0102,   0103,   0052,   0104,   0054,   0105,   0056,
/* PQRSTUVW */	0060,   0106,   0107,   0110,   0062,   0111,   0112,   0113,
/* XYZ[\]^_ */	0065,   0063,   0114,   0027,   0123,   0030,   0115,   0132,
/* `abcdefg */	0032,   0040,   0042,   0061,   0077,   0045,   0100,   0101,
/* hijklmno */	0055,   0102,   0103,   0052,   0104,   0054,   0105,   0056,
/* pqrstuvw */	0060,   0106,   0107,   0110,   0062,   0111,   0112,   0113,
/* xyz{|}~  */	0065,   0063,   0114,   0027,   0130,   0030,   0123,   0376,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/*          */	0,      0,      0,      0,      0,      0,      0,      0,
/* <>  e x: */	0116,   0117,   0,      0,      0020,   0,      0024,   0124,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/* */         	0,      0,      0,      0,      0,      0,      0,      0,
/* àáâãäåæç */	0075,   0040,   0041,   0066,   0044,   0045,   0064,   0043,
/* èéêëìíîï */	0065,   0050,   0051,   0052,   0053,   0054,   0055,   0056,
/* ðñòóôõö÷ */	0057,   0076,   0060,   0061,   0062,   0063,   0046,   0042,
/* øùúûüýþ  */	0073,   0072,   0047,   0070,   0074,   0071,   0067,   0135,
/* ÀÁÂÃÄÅÆÇ */	0075,   0040,   0041,   0066,   0044,   0045,   0064,   0043,
/* ÈÉÊËÌÍÎÏ */	0065,   0050,   0051,   0052,   0053,   0054,   0055,   0056,
/* ÐÑÒÓÔÕÖ× */	0057,   0076,   0060,   0061,   0062,   0063,   0046,   0042,
/* ØÙÚÛÜÝÞ  */	0073,   0072,   0047,   0070,   0074,   0071,   0067,   0135,
};

/* $ is a placeholder */
uchar gost_to_koi8_cyr[] = {
/* 000-037 */	"0123456789+-/,. e@()x=;[]*`'#<>:"
/* 040-077 */	"áâ÷çäåöúéêëìíîïðòóôõæèãþûýùøüàñD"
/* 100-137 */	"FGIJLNQRSUVWZ^\230\231v&?~\237=%$|-_!\"ÿ`'"
/* 140-177 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 200-237 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 240-277 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 300-337 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 340-377 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
};

uchar gost_to_koi8_lat[] = {
/* 000-037 */	"0123456789+-/,. e@()x=;[]*`'#<>:"
/* 040-077 */	"AâBçäEöúéêKìMHOðPCTYæXãþûýùøüàñD"
/* 100-137 */	"FGIJLNQRSUVWZ^\230\231v&?~\237=%$|-_!\"ÿ`'"
/* 140-177 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 200-237 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 240-277 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 300-337 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
/* 340-377 */	"$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
};

uchar *gost_to_koi8 = gost_to_koi8_cyr;

/*
 * Encoding of ITM autocode.
 * Documentation: http://besm6.googlegroups.com/web/%D0%90%D0%B2%D1%82%D0%BE%D0%BA%D0%BE%D0%B4-%D0%91%D0%AD%D0%A1%D0%9C6-%D0%B8%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D0%B8%D1%8F.pdf
 */
uchar koi8_to_itm[] = {
/*  !"#$%&' */	0017,	0063,	0134,	0152,	0042,	0062,	0071,	0041,
/* ()*+,-./ */	0076,	0051,	0170,	0061,	0046,	0070,	0047,	0067,
/* 01234567 */	0000,	0001,	0002,	0003,	0004,	0005,	0006,	0007,
/* 89:;<=>? */	0010,	0011,	0056,	0045,	0074,	0057,	0054,	0055,
/* @ABCDEFG */	0143,	0230,	0223,	0216,	0222,	0220,	0226,	0213,
/* HIJKLMNO */	0205,	0214,	0232,	0236,	0211,	0207,	0206,	0203,
/* PQRSTUVW */	0215,	0235,	0212,	0224,	0201,	0234,	0217,	0231,
/* XYZ[\]^_ */	0227,	0225,	0221,	0053,	0,	0066,	0050,	0043,
/* `abcdefg */	0064,	0230,	0223,	0216,	0222,	0220,	0226,	0213,
/* hijklmno */	0205,	0214,	0232,	0236,	0211,	0207,	0206,	0203,
/* pqrstuvw */	0215,	0235,	0212,	0224,	0201,	0234,	0217,	0231,
/* xyz{|}~  */	0227,	0225,	0221,	0,	0044,	0,	0145,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* */         	0,	0,	0,	0,	0,	0,	0,	0,
/* àáâãäåæç */	0334,	0230,	0323,	0316,	0322,	0220,	0326,	0313,
/* èéêëìíîï */	0227,	0314,	0332,	0236,	0311,	0207,	0205,	0203,
/* ðñòóôõö÷ */	0315,	0335,	0215,	0216,	0201,	0225,	0317,	0223,
/* øùúûüýþ  */	0327,	0325,	0321,	0324,	0320,	0301,	0331,	0136,
/* ÀÁÂÃÄÅÆÇ */	0334,	0230,	0323,	0316,	0322,	0220,	0326,	0313,
/* ÈÉÊËÌÍÎÏ */	0227,	0314,	0332,	0236,	0311,	0207,	0205,	0203,
/* ÐÑÒÓÔÕÖ× */	0315,	0335,	0215,	0216,	0201,	0225,	0317,	0223,
/* ØÙÚÛÜÝÞ  */	0327,	0325,	0321,	0324,	0320,	0301,	0331,	0136
};

/* ß is a placeholder */
uchar itm_to_koi8_cyr[] = {
/* 000-037 */	"0123456789ßßßßß ßßßßßßßßßßßßßßßß"
/* 040-077 */	" '$_|;,.^)ß[>?:=v+%!`:]/-&xß<`(ß"
/* 100-137 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßß\"ÿß'"
/* 140-177 */	"ßßß@ß~<>-ß#ßßßßßßßßßßßßß*ßßßßßeß"
/* 200-237 */	"ßôßïßîNíßLRGIòóVåZD÷SYFèáWJßUQëß"
/* 240-277 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß"
/* 300-337 */	"ßýßßßßßßßìßçéðãöüúäâûùæøßþêßàñßß"
/* 340-377 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß"
};

uchar itm_to_koi8_lat[] = {
/* 000-037 */	"0123456789ßßßßß ßßßßßßßßßßßßßßßß"
/* 040-077 */	" '$_|;,.^)ß[>?:=v+%!`:]/-&xß<`(ß"
/* 100-137 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßß\"ÿß'"
/* 140-177 */	"ßßß@ß~<>-ß#ßßßßßßßßßßßßß*ßßßßßeß"
/* 200-237 */	"ßTßOßHNMßLRGIPCVEZDBSYFXAWJßUQKß"
/* 240-277 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß"
/* 300-337 */	"ßýßßßßßßßìßçéðãöüúäâûùæøßþêßàñßß"
/* 340-377 */	"ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß"
};

uchar *itm_to_koi8 = itm_to_koi8_cyr;

/*
 * "Text" encoding of monitoring system Dubna.
 */
uchar text_to_koi8[] = {
/* 000-037 */	" .âãäæçé()*êìñö/0123456789ø,ð-+ù"
/* 040-077 */	"úABCDEFGHIJKLMNOPQRSTUVWXYZûüýþà"
};
