#ifdef __GNUC__
#define	GCC_SPECIFIC(x)	x
#else
#define	GCC_SPECIFIC(x)
#endif	/* __GNUC__ */

char   *errtxt[] = {
	" ξΕΙΪΧΕΣΤΞΑΡ ΟΫ.",     /*  0 */
	" λοξεγ ϊαδαώι",        /*  1 */
	" χΞΥΤÒ.ΟΫ.άΝΥΜ",       /*  2 */
	" πΟΛΑ ÒΑΞΟ",           /*  3 */
	" σΤΟΠ ΝΑΫΙΞΑ!",        /*  4 */
	" Err 5",               /*  5 */
	" Err 6",               /*  6 */
	" Err 7",               /*  7 */
	" Err 8",               /*  8 */
	" Err 9",               /*  9 */
	" Err 10",              /* 10 */
	" Err 11",              /* 11 */
	" Err 12",              /* 12 */
	" Err 13",              /* 13 */
	" δεμεξιε ξα ξυμψ",     /* 14 */
	" πεςεπομξεξιε αυ",     /* 15 */
	" ώισ.χ ώυφ.μιστε",     /* 16 */
	" λον.χ ώυφ.μιστε",     /* 17 */
	" ϊαπςεύ.λοναξδα",      /* 18 */
	" σξρτα οπεςατοςον",    /* 19 */
	" λοξτςομψ λοναξδω",    /* 20 */
	" οσταξοχ πο σώιτ.",    /* 21 */
	" οσταξοχ πο ϊαπ.",     /* 22 */
	" οσταξοχ πο λςα",      /* 23 */
	" ϊατεςτο σπο",         /* 24 */
	" χωχοδ ϊαπςεύεξ",      /* 25 */
	" ξεσυύ.χιδ ςαβοτω",    /* 26 */
	" σνεξιμσρ χιδ ςαβ",    /* 27 */
	" σβοκ   αςθιχα",       /* 28 */
	" νασ.ξε χθ.χ πομε",    /* 29 */
	" ξετ λοξγα βγ.ιξζ",    /* 30 */
	" δμ.νασσιχα>6200",     /* 31 */
	" δακ τςαλτω",          /* 32 */
	" οβςαύ.λ ξεϊαλ.νμ",    /* 33 */
	" οϋ.χ ιξζ.σμ.όλστ",    /* 34 */
	" οβςαύ.λ ξεσυύ.σπ",    /* 35 */
	" ϊαπςεύ.όλστςαλοδ",    /* 36 */
	" οϋιβλα νμ όχν",       /* 37 */
	" ιστελμο χςενρ",       /* 38 */
	" δακ νετςω αγπυ!",     /* 39 */
	" ιστελ.χςεν.πο όλ",    /* 40 */
	" ώισμ.χωδ.πλ>4096",    /* 41 */
	" οϋιβλα νδ όχν",       /* 42 */
	" ξετ νμ χ όλ.ςεσ",     /* 43 */
	" χ όλ.ςεσ.τςαλ>32",    /* 44 */
	" σξρτα πομψϊοχατ.",    /* 45 */
	" δακ ςαβ.χ όλ.ςεσ",    /* 46 */
	" ϊαπςεύ.ξαπς.χ όλ",    /* 47 */
	" οϋιβλα νβ όχν",       /* 48 */
	" ξεχεςξωκ  παςομψ",    /* 49 */
	" δακ ϊαπισψ ξα νμ",    /* 50 */
	" υϊεμ",                /* 51 */
	" αRσSIN(θ):|θ|>1",     /* 52 */
	" λοςεξψ(θ): θ <0",     /* 53 */
	" μοηαςιζν(θ):θ<0",     /* 54 */
	" εθς(θ): θ>44",        /* 55 */
	" ώισμο ϊοξ>200",       /* 56 */
	" ιξζ.σμ.χ ώυφ.μισ",    /* 57 */
	" μιστ χ όλ.ώυφοκ",     /* 58 */
	" νασσιχ ξε συύ-τ.",    /* 59 */
	" σξρμασψ  ημαχξαρ",    /* 60 */
	" ξετ νεστα χ λατα",    /* 61 */
	" σξρτα  ημαχξοκ",      /* 62 */
	" ν220 ξε πεςεδαμα",    /* 63 */
	" ώυφαρ ιξζοςναγιρ",    /* 64 */
	" σβο,χχεδι πο ιξσ",    /* 65 */
	" όλστς.>δοπυστ.",      /* 66 */
	" ϊαδαώα υπςρταξα",     /* 67 */
	" ξετ βοβιξω σχρϊι",    /* 68 */
	" λώ χ ςεφ.τεστα",      /* 69 */
	" ξε ϊαλαϊαξ τεςν.",    /* 70 */
	" ξελος.οβςαύεξιε",     /* 71 */
	" οβςωχ σχρϊι",         /* 72 */
	" οϋ.ϊπ ξα νμ",         /* 73 */
	" πο σώιτ.",            /* 74 */
	" πο ϊαπ.",             /* 75 */
	" λςα",                 /* 76 */
	" ξετ ιξζ. δμρ οτμ",    /* 77 */
	" εNQ<=οσταξ.=>DεQ",    /* 78 */
	" Err 79",              /* 79 */
	" Err 80",              /* 80 */
	" οϋ. υώετα",           /* 81 */
};

/*
 *      $Log: errtxt.c,v $
 *      Revision 1.2  2001/02/17 03:41:28  mike
 *      Merge with dvv (who sometimes poses as root) and leob.
 *
 *      Revision 1.1.1.1  2001/02/01 03:48:39  root
 *      e50 and -Wall fixes
 *
 *      Revision 1.2  2001/01/31 22:59:46  dvv
 *      fixes for Whetstone FORTRAN test;
 *      fixes to shut -Wall up and (more importantly) make scanf (and printf
 *      	args to match the formats
 *
 *      Revision 1.1  1999/01/22 18:35:24  mike
 *      Initial revision
 *
 */
