/*
 * BESM-6 stylized error messages.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * You can redistribute this program and/or modify it under the terms of
 * the GNU General Public License as published by the Free Software Foundation;
 * either version 2 of the License, or (at your discretion) any later version.
 * See the accompanying file "COPYING" for more details.
 */
char *errtxt[] = {
	" Неизвестная ош.",     /*  0 */
	" КОНЕЦ ЗАДАЧИ",        /*  1 */
	" Внутр.ош.эмул",       /*  2 */
	" Пока рано",           /*  3 */
	" Стоп машина!",        /*  4 */
	" Err 5",               /*  5 */
	" Err 6",               /*  6 */
	" Err 7",               /*  7 */
	" Err 8",               /*  8 */
	" Err 9",               /*  9 */
	" Err 10",              /* 10 */
	" Err 11",              /* 11 */
	" Err 12",              /* 12 */
	" Err 13",              /* 13 */
	" ДЕЛЕНИЕ НА НУЛЬ",     /* 14 */
	" ПЕРЕПОЛНЕНИЕ АУ",     /* 15 */
	" ЧИС.В ЧУЖ.ЛИСТЕ",     /* 16 */
	" КОМ.В ЧУЖ.ЛИСТЕ",     /* 17 */
	" ЗАПРЕЩ.КОМАНДА",      /* 18 */
	" СНЯТА ОПЕРАТОРОМ",    /* 19 */
	" КОНТРОЛЬ КОМАНДЫ",    /* 20 */
	" ОСТАНОВ ПО СЧИТ.",    /* 21 */
	" ОСТАНОВ ПО ЗАП.",     /* 22 */
	" ОСТАНОВ ПО КРА",      /* 23 */
	" ЗАТЕРТО СПО",         /* 24 */
	" ВЫВОД ЗАПРЕЩЕН",      /* 25 */
	" НЕСУЩ.ВИД РАБОТЫ",    /* 26 */
	" СМЕНИЛСЯ ВИД РАБ",    /* 27 */
	" СБОЙ   АРХИВА",       /* 28 */
	" МАС.НЕ ВХ.В ПОЛЕ",    /* 29 */
	" НЕТ КОНЦА БЦ.ИНФ",    /* 30 */
	" ДЛ.МАССИВА>6200",     /* 31 */
	" ДАЙ ТРАКТЫ",          /* 32 */
	" ОБРАЩ.К НЕЗАК.МЛ",    /* 33 */
	" ОШ.В ИНФ.СЛ.ЭКСТ",    /* 34 */
	" ОБРАЩ.К НЕСУЩ.СП",    /* 35 */
	" ЗАПРЕЩ.ЭКСТРАКОД",    /* 36 */
	" ОШИБКА МЛ ЭВМ",       /* 37 */
	" ИСТЕКЛО ВРЕМЯ",       /* 38 */
	" ДАЙ МЕТРЫ АЦПУ!",     /* 39 */
	" ИСТЕК.ВРЕМ.ПО ЭК",    /* 40 */
	" ЧИСЛ.ВЫД.ПК>4096",    /* 41 */
	" ОШИБКА МД ЭВМ",       /* 42 */
	" НЕТ МЛ В ЭК.РЕС",     /* 43 */
	" В ЭК.РЕС.ТРАК>32",    /* 44 */
	" СНЯТА ПОЛЬЗОВАТ.",    /* 45 */
	" ДАЙ РАБ.В ЭК.РЕС",    /* 46 */
	" ЗАПРЕЩ.НАПР.В ЭК",    /* 47 */
	" ОШИБКА МБ ЭВМ",       /* 48 */
	" НЕВЕРНЫЙ  ПАРОЛЬ",    /* 49 */
	" ДАЙ ЗАПИСЬ НА МЛ",    /* 50 */
	" УЗЕЛ",                /* 51 */
	" АRСSIN(Х):|Х|>1",     /* 52 */
	" КОРЕНЬ(Х): Х <0",     /* 53 */
	" ЛОГАРИФМ(Х):Х<0",     /* 54 */
	" ЕХР(Х): Х>44",        /* 55 */
	" ЧИСЛО ЗОН>200",       /* 56 */
	" ИНФ.СЛ.В ЧУЖ.ЛИС",    /* 57 */
	" ЛИСТ В ЭК.ЧУЖОЙ",     /* 58 */
	" МАССИВ НЕ СУЩ-Т.",    /* 59 */
	" СНЯЛАСЬ  ГЛАВНАЯ",    /* 60 */
	" НЕТ МЕСТА В КАТА",    /* 61 */
	" СНЯТА  ГЛАВНОЙ",      /* 62 */
	" М220 НЕ ПЕРЕДАЛА",    /* 63 */
	" ЧУЖАЯ ИНФОРМАЦИЯ",    /* 64 */
	" СБО,ВВЕДИ ПО ИНС",    /* 65 */
	" ЭКСТР.>ДОПУСТ.",      /* 66 */
	" ЗАДАЧА УПРЯТАНА",     /* 67 */
	" НЕТ БОБИНЫ СВЯЗИ",    /* 68 */
	" КЧ В РЕЖ.ТЕСТА",      /* 69 */
	" НЕ ЗАКАЗАН ТЕРМ.",    /* 70 */
	" НЕКОР.ОБРАЩЕНИЕ",     /* 71 */
	" ОБРЫВ СВЯЗИ",         /* 72 */
	" ОШ.ЗП НА МЛ",         /* 73 */
	" ПО СЧИТ.",            /* 74 */
	" ПО ЗАП.",             /* 75 */
	" КРА",                 /* 76 */
	" НЕТ ИНФ. ДЛЯ ОТЛ",    /* 77 */
	" ЕNQ<=ОСТАН.=>DЕQ",    /* 78 */
	" Err 79",              /* 79 */
	" Err 80",              /* 80 */
	" ОШ. УЧЕТА",           /* 81 */
};
